cask_args appdir: "/Applications"

# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"

# Utilities
# brew "adr-tools"
# brew "awscli"
brew "bash"
# brew "bash-completion"
brew "cask"
# brew "composer"
brew "jq"
brew "mas"
# brew "php"
brew "tfenv"
brew "youtube-dl"
# brew "cloudfoundry/tap/cf-cli"

# Apps
cask "alttab"
cask "malwarebytes"
#cask "balenaetcher"
cask "calibre"
cask "dbeaver-community"
cask "diffmerge"
cask "discord"
cask "docker"
cask "drawio"
cask "flux"
cask "gnucash"
cask "google-chrome"
cask "hex-fiend"
cask "iterm2"
cask "itsycal"
cask "jetbrains-toolbox"
cask "paw"
cask "postgres"
cask "qlcolorcode"      # general code
cask "qlmarkdown"       # md
cask "qlstephen"        # all other files
cask "quicklook-csv"    # csv
cask "quicklook-json"   # json
cask "scroll-reverser"
cask "sourcetree"
cask "temurin"          # Adoptium JDK
cask "visual-studio-code"
cask "vlc"
cask "zoom"

# Apps (App Store)
mas "Dont Sleep", id: 466314666
mas "Grammarly for Safari", id: 1462114288
mas "Keynote", id: 409183694
mas "Microsoft OneNote", id: 784801555
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Sequel Ace", id: 1518036000 # replacement for Sequel Pro
mas "Skitch", id: 425955336
mas "Slack", id: 803453959
mas "The Unarchiver", id: 425424353
mas "uBlock", id: 1385985095
mas "Xcode", id: 497799835
