cask_args appdir: "/Applications"

# Taps
tap "caskroom/cask"
# tap "cloudfoundry/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/cask-versions"

# Utilities
brew "adr-tools"
brew "ansible"
brew "awscli"
brew "bash"
brew "bash-completion"
brew "cask"
brew "composer"
brew "jq"
brew "mas"
brew "node"
brew "php"
brew "terraform"
brew "youtube-dl"
# brew "cloudfoundry/tap/cf-cli"

# Apps
cask "adoptopenjdk"
cask "calibre"
cask "dbeaver-community"
cask "diffmerge"
cask "docker"
cask "firefox"
cask "flux"
cask "gnucash"
cask "google-chrome"
cask "iterm2"
cask "itsycal"
cask "jetbrains-toolbox"
cask "paw"
cask "postgres"
cask "qlcolorcode"      # general code
cask "qlmarkdown"       # md
cask "qlstephen"        # all other files
cask "quicklook-csv"    # csv
cask "quicklook-json"   # json
cask "scroll-reverser"
cask "sourcetree"
cask "vagrant"
cask "virtualbox"
cask "visual-studio-code"
cask "vlc"
cask "zoomus"

# Apps (App Store)
mas "Dont Sleep", id: 466314666
mas "Grammarly for Safari", id: 1462114288
mas "Keynote", id: 409183694
mas "Microsoft Excel", id: 462058435
mas "Microsoft OneNote", id: 784801555
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Remote Desktop", id: 1295203466
mas "Microsoft Word", id: 462054704
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Skitch", id: 425955336
mas "Slack", id: 803453959
mas "The Unarchiver", id: 425424353
mas "Trello", id: 1278508951
mas "uBlock", id: 1385985095
mas "Xcode", id: 497799835
